# https://dart-fss.readthedocs.io/en/latest/dart_types.html
dict_pblntf_ty = {
    "A": "정기공시",
    "B": "주요사항보고",
    "C": "발행공시",
    "D": "지분공시",
    "E": "기타공시",
    "F": "외부감사관련",
    "G": "펀드공시",
    "H": "자산유동화",
    "I": "거래소공시",
    "J": "공정위공시"
}

dict_pblntf_detail_ty = {
    "A001": "사업보고서",
    "A002": "반기보고서",
    "A003": "분기보고서",
    "A004": "등록법인결산서류(자본시장법이전)",
    "A005": "소액공모법인결산서류",
    "B001": "주요사항보고서",
    "B002": "주요경영사항신고(자본시장법 이전)",
    "B003": "최대주주등과의거래신고(자본시장법 이전)",
    "C001": "증권신고(지분증권)",
    "C002": "증권신고(채무증권)",
    "C003": "증권신고(파생결합증권)",
    "C004": "증권신고(합병등)",
    "C005": "증권신고(기타)",
    "C006": "소액공모(지분증권)",
    "C007": "소액공모(채무증권)",
    "C008": "소액공모(파생결합증권)",
    "C009": "소액공모(합병등)",
    "C010": "소액공모(기타)",
    "C011": "호가중개시스템을통한소액매출",
    "D001": "주식등의대량보유상황보고서",
    "D002": "임원ㆍ주요주주특정증권등소유상황보고서",
    "D003": "의결권대리행사권유",
    "D004": "공개매수",
    "E001": "자기주식취득/처분",
    "E002": "신탁계약체결/해지",
    "E003": "합병등종료보고서",
    "E004": "주식매수선택권부여에관한신고",
    "E005": "사외이사에관한신고",
    "E006": "주주총회소집공고",
    "E007": "시장조성/안정조작",
    "E008": "합병등신고서(자본시장법 이전)",
    "E009": "금융위등록/취소(자본시장법 이전)",
    "F001": "감사보고서",
    "F002": "연결감사보고서",
    "F003": "결합감사보고서",
    "F004": "회계법인사업보고서",
    "F005": "감사전재무제표미제출신고서",
    "G001": "증권신고(집합투자증권-신탁형)",
    "G002": "증권신고(집합투자증권-회사형)",
    "G003": "증권신고(집합투자증권-합병)",
    "H001": "자산유동화계획/양도등록",
    "H002": "사업/반기/분기보고서",
    "H003": "증권신고(유동화증권등)",
    "H004": "채권유동화계획/양도등록",
    "H005": "수시보고",
    "H006": "주요사항보고서",
    "I001": "수시공시",
    "I002": "공정공시",
    "I003": "시장조치/안내",
    "I004": "지분공시",
    "I005": "증권투자회사",
    "I006": "채권공시",
    "J001": "대규모내부거래관련",
    "J002": "대규모내부거래관련(구)",
    "J004": "기업집단현황공시",
    "J005": "비상장회사중요사항공시",
    "J006": "기타공정위공시"
}

dict_corp_cls = {
    "Y": "유가증권",
    "K": "코스",
    "N": "코넥스",
    "E": "etc"
}

dict_rm = {
    "유": "본 공시사항은 한국거래소 유가증권시장본부 소관임",
    "코": "본 공시사항은 한국거래소 코스닥시장본부 소관임",
    "채": "본 문서는 한국거래소 채권상장법인 공시사항임",
    "넥": "본 문서는 한국거래소 코넥스시장 소관임",
    "공": "본 공시사항은 공정거래위원회 소관임",
    "연": "본 보고서는 연결부분을 포함한 것임",
    "정": "본 보고서 제출 후 정정신고가 있으니 관련 보고서를 참조하시기 바람",
    "철": "본 보고서는 철회(간주)되었으니 관련 철회신고서(철회간주안내)를 참고하시기 바람"
}

columns_corp_code = {
    'corp_code': '고유번호',
    'corp_name': '정식명칭',
    'stock_code': '종목코드',
    'modify_date': '최종변경일자'
}

columns_search_document = {
    'corp_cls': '법인구분',
    'corp_name': '종목명(법인명)',
    'corp_code': '고유번호',
    'stock_code': '종목코드',
    'report_nm': '보고서명',
    'rcept_no': '접수번호',
    'flr_nm': '공시 제출인명',
    'rcept_dt': '접수일자',
    'rm': '비고'
}

columns_major_stock_info = {
    'rcept_no': '접수번호',
    'rcept_dt': '접수일자',
    'corp_code': '고유번호',
    'cmpny_nm': '회사명',
    'report_tp': '보고구분',
    'repror': '대표보고자',
    'stkqy': '보유주식등의 수',
    'stkqy_irds': '보유주식등의 증감',
    'stkrt': '보유비율',
    'stkrt_irds': '	보유비율 증감',
    'ctr_stkqy': '주요체결 주식등의 수',
    'ctr_stkrt': '주요체결 보유비율',
    'report_resn': '보고사유'
}

columns_executive_stock_info = {
    'rcept_no': '접수번호',
    'rcept_dt': '접수일자',
    'corp_code': '고유번호',
    'corp_name': '회사명',
    'repror': '보고자',
    'isu_exctv_rgist_at': '발행 회사 관계 임원(등기여부)',
    'isu_exctv_ofcps': '발행 회사 관계 임원 직위',
    'isu_main_shrholdr': '발행 회사 관계 주요 주주',
    'sp_stock_lmp_cnt': '특정 증권 등 소유 수',
    'sp_stock_lmp_irds_cnt': '특정 증권 등 소유 증감 수',
    'sp_stock_lmp_rate': '특정 증권 등 소유 비율',
    'sp_stock_lmp_irds_rate': '특정 증권 등 소유 증감 비율'
}

columns_financial_info = {
    'corp_code': '고유번호',
    'rcept_no': '접수번호',
    'bsns_year': '사업연도',
    'stock_code': '종목코드',
    'reprt_code': '보고서코드',
    'account_nm': '계정명',
    'fs_div': '개별/연결구분',
    'fs_nm': '개별/연결명',
    'sj_div': '재무제표구분',
    'sj_nm': '재무제표명',
    'thstrm_nm': '당기명',
    'thstrm_dt': '당기일자',
    'thstrm_amount': '당기금액',
    'thstrm_add_amount': '당기누적금액',
    'frmtrm_nm': '전기명',
    'frmtrm_dt': '전기일자',
    'frmtrm_amount': '전기금액',
    'frmtrm_add_amount': '전기누적금액',
    'bfefrmtrm_nm': '전전기명',
    'bfefrmtrm_dt': '전전기일자',
    'bfefrmtrm_amount': '전전기금액',
    'ord': '계정과목정렬순서'
}

columns_company_info = {
    'corp_code': '고유번호',
    'corp_name': '정식명칭',
    'corp_name_eng': '영문명칭',
    'stock_name': '종목명',
    'stock_code': '종목코드',
    'ceo_nm': '대표자명',
    'corp_cls': '법인구분',
    'jurir_no': '법인등록번호',
    'bizr_no': '사업자등록번호',
    'adres': '주소',
    'hm_url': '홈페이지',
    'ir_url': 'IR홈페이지',
    'phn_no': '전화번호',
    'fax_no': '팩스번호',
    'induty_code': '업종코드',
    'est_dt': '설립일',
    'acc_mt': '결산월'
}

columns_declaration_info_normal = {
    'rcept_no': '접수번호',
    'corp_cls': '법인구분',
    'corp_code': '고유번호',
    'corp_name': '회사명',
    'stn': '형태',
    'bddd': '이사회 결의일',
    'ctrd': '계약일',
    'gmtsck_shddstd': '주주총회를 위한 주주확정일',
    'ap_gmtsck': '승인을 위한 주주총회일',
    'aprskh_pd_bgd': '주식매수청구권 행사 기간 및 가격(시작일)',
    'aprskh_pd_edd': '주식매수청구권 행사 기간 및 가격(종료일)',
    'aprskh_prc': '주식매수청구권 행사 기간 및 가격((주식매수청구가격-회사제시))',
    'mgdt_etc': '합병기일등',
    'rt_vl': '비율 또는 가액',
    'exevl_int': '외부평가기관',
    'grtmn_etc': '지급 교부금 등',
    'rpt_rcpn': '주요사항보고서(접수번호)'
}

columns_declaration_info_stock = {
    'rcept_no': '접수번호',
    'corp_cls': '법인구분',
    'corp_code': '고유번호',
    'corp_name': '회사명',
    'kndn': '종류',
    'cnt': '수량',
    'fv': '액면가액',
    'slprc': '모집(매출)가액',
    'slta': '모집(매출)총액'
}

columns_declaration_info_detail = {
    'rcept_no': '접수번호',
    'corp_cls': '법인구분',
    'corp_code': '고유번호',
    'corp_name': '공시대상회사명',
    'cmpnm': '회사명',
    'sen': '구분',
    'tast': '총자산',
    'cpt': '자본금',
    'isstk_knd': '발행주식수(주식의종류)',
    'isstk_cnt': '발행주식수(주식수)'
}